[
    {
        "id":"brightport_key",
        "iconID":"items_misc:21",
        "name":"Library key",
        "displaytype":"quest",
        "category":"other",
        "description":"The key for the library in Brightport."
    },
    {
        "id":"brightport_scroll",
        "iconID":"items_books:8",
        "name":"Secret scroll",
        "displaytype":"quest",
        "category":"other",
        "description":"A secret scroll kept in the library of Brightport. The headline reads: Concerning the mixture of kazarite dust within the foundational ingredients of a bonemeal potion. "
    },
    {
        "id":"brightport_fruit",
        "iconID":"items_japozero:528",
        "name":"Fresh fruit for Stanwick",
        "displaytype":"quest",
        "category":"other",
        "description":"A gathering of fresh fruit, given to me by Janwick."
    },
    {
        "id":"brightport_bone",
        "iconID":"items_newb:664",
        "name":"Lizardman bone",
        "displaytype":"ordinary",
        "category":"animal",
        "description":"Still has a bit of meat on it, could use some drying"
    },
    {
        "id":"brightport_note",
        "iconID":"items_japozero:426",
        "name":"Written note",
        "displaytype":"quest",
        "category":"other",
        "description":"The note contains your best attempt at writing down a question. It reads: Could you tell me what you know about the library incident?"
    },
    {
        "id":"brightport_deer",
        "iconID":"items_newb:625",
        "name":"Deer antlers",
        "displaytype":"ordinary",
        "category":"animal",
        "description":"Antlers taken from a brightport deer."
    },
    {
        "id":"brightport_ink",
        "iconID":"items_japozero:461",
        "name":"Ink",
        "displaytype":"ordinary",
        "category":"other"
    },
    {
        "id":"brightport_paper",
        "iconID":"items_japozero:421",
        "name":"Paper",
        "displaytype":"ordinary",
        "category":"other"
    },
    {
        "id":"brightport_meat",
        "iconID":"items_newb:773",
        "name":"Cooked deer meat",
        "displaytype":"ordinary",
        "hasManualPrice":1,
        "baseMarketCost":213,
        "category":"food",
        "description":"Gamey with a grassy aftertaste",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":4,
                    "duration":10,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightport_rawmeat",
        "iconID":"items_newb:772",
        "name":"Raw deer meat",
        "displaytype":"ordinary",
        "category":"food",
        "description":"Gamey with a grassy aftertaste",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"brightport_worm",
                    "magnitude":2,
                    "duration":10,
                    "chance":"10"
                },
                {
                    "condition":"food",
                    "magnitude":3,
                    "duration":10,
                    "chance":"100"
                },
                {
                    "condition":"foodp",
                    "magnitude":4,
                    "duration":10,
                    "chance":"15"
                }
            ]
        }
    },
    {
        "id":"brightportgloves",
        "iconID":"items_newb:8",
        "name":"Deerskin gloves",
        "displaytype":"rare",
        "category":"hnd_lthr",
        "description":"A sturdy pair of gloves crafted out of the skin of an elder Elkdeer.",
        "equipEffect":{
            "increaseMaxHP":5,
            "increaseBlockChance":8,
            "increaseDamageResistance":2
        }
    },
    {
        "id":"brightportflamesword",
        "iconID":"items_weapons:41",
        "name":"Flaming greatsword",
        "displaytype":"extraordinary",
        "category":"2hsword",
        "description":"Sizzling the flesh of evil beasts, and your hands alike.",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":6,
                "max":12
            },
            "increaseAttackCost":6,
            "increaseBlockChance":10,
            "setCriticalMultiplier":0.0,
            "setNonWeaponDamageModifier":103
        },
        "hitEffect":{
            "conditionsSource":[
                {
                    "condition":"brightportflame",
                    "magnitude":1,
                    "duration":2,
                    "chance":"40"
                }
            ],
            "conditionsTarget":[
                {
                    "condition":"brightportflame",
                    "magnitude":1,
                    "duration":1,
                    "chance":"30"
                }
            ]
        }
    },
    {
        "id":"brightport_glove",
        "iconID":"items_omi2:5",
        "name":"Salamander gloves",
        "displaytype":"rare",
        "category":"hnd_lthr",
        "description":"Fire-proof gloves crafted out of arulir skin. somehow named after a lizard instead.",
        "equipEffect":{
            "increaseBlockChance":3,
            "addedConditions":[
                {
                    "condition":"brightportflame",
                    "magnitude":-99
                }
            ]
        }
    },
    {
        "id":"brightport_bakery",
        "iconID":"items_newb:844",
        "name":"Brightport bread",
        "displaytype":"ordinary",
        "category":"food",
        "description":"Present on the table of every self respecting nobleman",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":2,
                    "duration":10,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightport_bakery1",
        "iconID":"items_newb:848",
        "name":"Apple pie",
        "displaytype":"ordinary",
        "category":"food",
        "description":"Sweet and sour",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":3,
                    "duration":8,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightport_dagger",
        "iconID":"items_newb:484",
        "name":"Hunter's knife",
        "displaytype":"ordinary",
        "category":"ssword",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":3,
                "max":6
            },
            "increaseAttackCost":4
        }
    },
    {
        "id":"brightport_sword",
        "iconID":"items_phoenix01:59",
        "name":"Pyrite scimitar",
        "displaytype":"rare",
        "category":"ssword",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":6,
                "max":8
            },
            "increaseAttackCost":4,
            "increaseAttackChance":10,
            "increaseCriticalSkill":2,
            "increaseBlockChance":3,
            "increaseDamageResistance":-1,
            "setCriticalMultiplier":2.0
        }
    },
    {
        "id":"brightport_bonemeal",
        "iconID":"items_newb:739",
        "name":"Essence concentrate potion",
        "displaytype":"rare",
        "category":"drink",
        "description":"Concentrated bonemeal infusion, a true alchemical masterpiece. Much more potent than a normal potion.",
        "useEffect":{
            "increaseCurrentHP":{
                "min":80,
                "max":80
            }
        }
    },
    {
        "id":"brightport_book",
        "iconID":"items_japozero:332",
        "name":"The Noble Wars",
        "displaytype":"ordinary",
        "category":"other",
        "description":"n the year 57 of the era of prosperity, our king and hero, King Luthor, died. The lords, dukes, and nobles gathered in the capital to attend the funerary process of the king in the city of Fallhaven, at the time a great city, extending much farther to the south. Not long after, the nobility found themselves at an impasse, who would become the next ruler? King Luthor had left behind no heir, and the opinions of the nobles shifted amongst themselves. One side pushed for Lord Erwin of House Garland, the ruling house of Stoutford, as the new king. It is to be noted that Stoutford had long been the military center of the kingdom, experienced and hardened in their clashes with the uncivilized tribes of the western bogs and wildlands, as well as the occasional demonic incursions of Undertell. The warriors of Stoutford were a significant force, forming the elite corps of the kingdom. Many nobles disagreed with House Garland ruling and instead favored Lord Emeric of House Houdart, the ruling house of Nor City, the kingdom's historical capital and center of culture and worship of the Shadow. The third faction rallied around Lord Geomyr of House Aumwill, the lord of Feygard and the former king's advisor. Lastly, a final faction formed by the nobles of the central lands, who at first remained neutral, but fearing that a new king might threaten the status of Fallhaven as capital and shift power away, chose to oppose the others. As discussions progressed, the four factions soon solidified into four coalitions. The Western Coalition, formed by Lord Erwin and his vassals, was centered around the town of Stoutford, along with it were the town of Prim and the settlement of Blackwater Mountain. The Central Coalition was formed by the various nobility of Crossglen, Loneford, Fallhaven, Vilegard, and Charwood. The Eastern Coalition was formed by the great houses of Nor City with Lord Emeric in charge, along with the other minor nobility and clergy, who sought to return the king of the Shadow-aligned kingdom back to  the historical center of worship. Lastly, the Northern Coalition, led by Lord Geomyr, was comprised of the city of Feygard, which housed the loathed cult of Elythara, as well as the mountain settlement of Thalgard and the town of Remgard. With this, the sides were set. What was at first whispered turned to shouts of command. Lord Erwin rallied his troops to be the one first to move towards the central lands, the spies of the various factions riding their horses in a hurry to announce their overlords. By the time news reached the East, the Western troops were on the move. The 1st, 2nd, and 3rd army groups advanced north, towards Loneford, south towards Sullengard, and northeast towards the capital. The 1st group had met no resistance taking Crossglen, and the occupation of the village was relatively peaceful until the end of the conflicts.  In Fallhaven, the nobles, lacking central leadership, hurriedly mustered a militia force to man the palisades and resist the western coalition, having managed to do so in time to offer resistance to the 2nd army. Meanwhile, the 3rd army, moving south, struggled to cross the Sutdover River, delaying their advance on Sullengard.  The houses of Nor City were caught off guard; no one had assumed the conflict would begin so soon. Nonetheless, troops were rallied. House Houdart led the army, with the trained warriors of its branching houses forming the army groups. Orders were sent to the regional leadership, and the armies were dispatched. The 1st army was led by Lord Emeric of Imeria Houdart The 2nd army was led by Duke Vergas of Ryfarion Houdart, and the 3rd army was led by Baron Benzimos of Worgand Houdart. Ensuring a Houdart-led kingdom, would they succeed  Lord Emeric moved his army towards Fallhaven as the attack of the Western Coalition commenced, deceptive correspondence painting himself to the central nobles as reinforcements. Ensuring the towns of Vilegard and Charwood would join in with the coalition. The second army merged with the troops of Brightport and Brimhaven, while the third moved south to defend Sullengard.  And so it commenced, the start of the First Noble War. The 1st group of the western coalition advanced to the crossroads fortification, capturing it with minor resistance. Scouts were sent south and north to gauge the other coalition's approach, as the bulk of the troops moved towards the defenseless Loneford. In the south, the Western forces had passed the river and were on the eastern bank, moving towards Sullengard. In the center, Stoutford’s elite forces crushed the meager militia and forcefully assimilated the town guard into their ranks, just in time, as Lord Emeric and his troops approached from the east.  The Battle of Fallhaven began. Bodies fell on each side. The numerous troops of Nor City barely barely held on against Stoutford’s hardened elite. The city burned, its inhabitants forced to hide or flee. Its wealthier citizens had already escaped to Feygard, taking their possessions with them.  In the south, the troops of the 3rd group of the Western Coalition met with the forces of the Eastern Coalition, led by Baron Benzimos. The two armies clashes, and the Western Coalition was on its back foot opting for a retreat,  rushing to the western bank of the river, hoping to form a defensive line at the bridge and defend Stoutford's southern flank, the plan to capture Sullengard having failed. To the north, Stoutford’s troops secured Loneford with ease. Scouts reported no movement from the northern coalition. Lord Emeric’s central forces soon moved to contest the crossroads, leading to skirmishes along the Duleian Road. Meanwhile, the Eastern Coalition’s 2nd army, led by Duke Vergas, wary of Feygard’s movements, sent scouts north to assess the Northern Coalition’s response as their forces moved to merge with Brimhaven's forces.  This predicament continued for many years. Battles devolved into minor skirmishes as both coalitions avoided any decisive engagements, unwilling to risk the lives of their troops. Both sides camped outside the ever-burning ruins of Fallhaven. In the south, the Sutdover River became the dividing line, while in the north, skirmishes were taking place in the forest between Brimhaven and Loneford. The Northern Coalition having made no move. The prolonged stalemate created a false sense of security. The garrisons of the encampments set to protect the flanks of both coalitions steadily diminished as the main forces required reinforcements to replenish their ranks.  An uneasy truce took hold, allowing each side time to recover for a decisive battle.  The war exposed the strengths and weaknesses of both sides. The Eastern Coalition, backed by Nor City, wielded immense wealth and manpower but it was stretched thin, its armies spread too far apart.  The Western Coalition could afford to fight the larger forces of the East due to each group's proximity to the coalition's center of power in Stoutford. Manpower was an issue, but the West employed prisoners from the mines as footmen, with its elite corps of warriors being able to turn a disadvantage of numbers into an equal fight.  Lord Emeric devised a plan. He wanted to capture Fallhaven and secure the symbol of the king from Luthor's grave. He would cut down Erwin's reinforcements in Fallhaven via an attack from the south and then attack the Western Coalition in Fallhaven. The period of the Second War commenced.  The East reinforced its southern army led by Baron Vergas, ordering him to attack the bridge and take it at all costs. This success led to a panic in the center of the West's forces. The ruins of Fallhaven, now a smoldering ground far from its marble clad roads and opulent buildings. were contested by skirmishes nearly every day. The reinforcements from Stoutford and Blackwater allowed the 2nd group to hold its line, but the sudden advance from the south required that the supply of recruits was to focus on the Sutdover flank. Having moved according to the Eastern Coalition's plan, Emeric rallied his troops. The Second Battle of Fallhaven commenced. Larger and more brutal than the first, having fought for months on end, both sides lost hundreds of troops. Lord Emeric's coalition, having seemingly bested their enemies, started advancing. At that same time, the expected unexpectedly happened.  The Third period of the Noble Wars started.  The troops of Feygard moved south from Feygard and Falgard, crushing the minor garrisons set to defend against the north and moved to capture Loneford and Brimhaven. In Brimhaven, the leadership panicked and switched sides, leaving a portion of the 1st Eastern group led by Vergas Ryfarion to follow Brimhaven and switch sides. The loyal to Nor City Vergas fled along with his troops to Brightport.  Loneford was swiftly captured, and the advance of the Northern Coalition to Feygard was imminent.  The Eastern Coalition was the first to disengage, with the forces of Baron Benzimos retreating to the stronghold of Sullengard. Meanwhile, the remaining troops of Lord Emeric moved south on the Duleian. Lord Geomyr split his forces in two: one chased after Lord Emeric's army, while the other moved to capture the remains of Fallhaven  In Brightport, Feygard fought the 2nd group of the Eastern Coalition and was successful in breaking their resistance. Feygard captured Fallhaven and Crossglen, then moved toward Stoutford, where the Western Coalition prepared for a siege. Feygard caught up to the fleeing Eastern 1st Army group and dealt a devastating blow to the exhausted forces. Baron Benzimos left a small contingent  to defend Sullengard and moved to assist his lord in the Battle of the Now Cursed Plains.  The Blackwater settlements were bribed to cut their support of the Western Coalition; their leaders were spared. The Northern Coalition, led by Feygard, laid siege to Stoutford, capturing Lord Erwin and executing him, along with the surviving members of House Garland.  The decisive battle between the 1st Feygard and 1st Nor City groups ended with Baron Benzimos’ reckless charge into the ranks of armored Feygard knights leading to his demise. lord Emeric was killed by a stray arrow, and only a third of the army returned to Nor City. House Welfort took control and signed a treaty with Feygard. Lord Geomyr was crowned king, marking the end of the war. "
    },
    {
        "id":"brightport_rice",
        "iconID":"items_japozero:591",
        "name":"Rice",
        "displaytype":"ordinary",
        "hasManualPrice":1,
        "baseMarketCost":12,
        "category":"food",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":1,
                    "duration":4,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightportpackage",
        "iconID":"items_japozero:472",
        "name":"Package",
        "displaytype":"quest",
        "category":"other"
    },
    {
        "id":"brightport_ring",
        "iconID":"items_newb:259",
        "name":"Stanwick's signet ring",
        "displaytype":"quest",
        "category":"ring",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":1,
                "max":3
            },
            "increaseAttackChance":15,
            "increaseCriticalSkill":3,
            "increaseBlockChance":10,
            "increaseDamageResistance":3
        }
    },
    {
        "id":"brightport_sword0",
        "iconID":"items_misc_2:65",
        "name":"Nor city made blade",
        "displaytype":"quest"
    },
    {
        "id":"brutal_steel_mace",
        "iconID":"items_newb:466",
        "name":"Brutal steel mace",
        "displaytype":"ordinary",
        "hasManualPrice":0,
        "baseMarketCost":2522,
        "category":"mace",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":6,
                "max":17
            },
            "increaseAttackCost":7,
            "increaseAttackChance":20,
            "increaseCriticalSkill":5,
            "setCriticalMultiplier":3.25,
            "setNonWeaponDamageModifier":146
        }
    },
    {
        "id":"brutal_hammer",
        "iconID":"items_newb:473",
        "name":"Brutal hammer",
        "displaytype":"ordinary",
        "hasManualPrice":0,
        "baseMarketCost":2522,
        "category":"hammer",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":4,
                "max":19
            },
            "increaseAttackCost":7,
            "increaseAttackChance":17,
            "increaseCriticalSkill":5,
            "setCriticalMultiplier":3.25,
            "setNonWeaponDamageModifier":157
        }
    },
    {
        "id":"brightport_broom",
        "iconID":"items_weapons:55",
        "name":"Broom",
        "displaytype":"ordinary",
        "hasManualPrice":1,
        "baseMarketCost":100,
        "category":"pole",
        "description":"A broom for sweeping.",
        "equipEffect":{
            "increaseAttackDamage":{
                "min":1,
                "max":4
            },
            "increaseAttackChance":5
        }
    },
    {
        "id":"brightport_green",
        "iconID":"items_consumables:16",
        "name":"Stuffed pepper",
        "displaytype":"ordinary",
        "category":"food",
        "description":"A traditional Crossglen recipe. Mild taste but filling.",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":4,
                    "duration":8,
                    "chance":"100"
                },
                {
                    "condition":"sated",
                    "magnitude":1,
                    "duration":1,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightport_yellow",
        "iconID":"items_consumables:17",
        "name":"Stuffed pepper",
        "displaytype":"ordinary",
        "category":"food",
        "description":"A traditional Crossglen recipe. Flavourful and pleasant.",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"food",
                    "magnitude":4,
                    "duration":10,
                    "chance":"100"
                },
                {
                    "condition":"sated",
                    "magnitude":2,
                    "duration":1,
                    "chance":"100"
                }
            ]
        }
    },
    {
        "id":"brightport_red",
        "iconID":"items_consumables:18",
        "name":"Stuffed pepper",
        "displaytype":"rare",
        "category":"food",
        "description":"A traditional Crossglen recipe. Perhaps a bit too spicy.",
        "useEffect":{
            "conditionsSource":[
                {
                    "condition":"brightportflame",
                    "magnitude":1,
                    "duration":2,
                    "chance":"30"
                },
                {
                    "condition":"food",
                    "magnitude":5,
                    "duration":10,
                    "chance":"100"
                },
                {
                    "condition":"sated",
                    "magnitude":1,
                    "duration":1,
                    "chance":"100"
                }
            ]
        }
    }
]