[
    {
        "id":"Stanwickquest",
        "name":"No rest for the wicked",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"I arrived at Brightport's school,  to be told that Stanwick is under investigation and that he is not allowed visitors."
            },
            {
                "progress":10,
                "logText":"Janwick, Stanwick's grandfather mistook me for Andor and asked me to deliver some fresh fruit to Stanwick."
            },
            {
                "progress":15,
                "logText":"I was allowed to visit Stanwick."
            },
            {
                "progress":16,
                "logText":"Stanwick is currently under investigation as the main suspect in the disappearance of an important scroll from the school library."
            },
            {
                "progress":20,
                "logText":"Stanwick has something important to tell me about Andor, but I must help him first."
            },
            {
                "progress":25,
                "logText":"I agreed to help Stanwick find the culprit of the theft, I should look for clues around the school."
            },
            {
                "progress":30,
                "logText":"Milena, the school cook, had told me that she noticed a student from the living quarters sneaking off at night months prior."
            },
            {
                "progress":31,
                "logText":"Dibella the Lady from the desk at the entrance, had told me that, as a honor student Stanwick's reputation is respectable but even so, as the library supervisor he must be considered a suspect."
            },
            {
                "progress":35,
                "logText":"Oswald, the Headmaster, has expressed his disbelief in Stanwick being guilty of the theft, and told me of the importance of the stolen scroll and that it must be returned to him."
            },
            {
                "progress":40,
                "logText":"Frederich the history teacher, who moved in from Feygard, believes Stanwick is associated with Those Nor city savages and was told by them to steal the document."
            },
            {
                "progress":45,
                "logText":"Franz the math teacher had told me that the most logical thing to do is to investigate the library, which is sealed. I must find a way to access it."
            },
            {
                "progress":46,
                "logText":"I asked the headmaster for access to the library, and he denied me."
            },
            {
                "progress":47,
                "logText":"I stole the library's key from a shelf while the headmaster was distracted. This will have consequences."
            },
            {
                "progress":50,
                "logText":"Counterfeit, a thieves guild member in the basement of the Brightport warehouse gave me a copy of the library key. "
            },
            {
                "progress":55,
                "logText":"In the library's basement archive I found a record of a now retired baker requesting to read the secret scroll, but having been denied. I should seek out their whereabouts."
            },
            {
                "progress":60,
                "logText":"Richimor, the old man sitting by the lake shore in Brightport was an acquittance of Bryma, he said she left Brightport many years ago and did not inform him of her destination, but she left a large part of her research material at his house, I should check it."
            },
            {
                "progress":65,
                "logText":"Inside Richimor's house i found a bundle of papers left by Bryma, In there amongst the trivial writings, one paper stood out to as it talked about strange statues in the vicinity of brightport."
            },
            {
                "progress":66,
                "logText":"I discovered a strange statue in the forest south of Brightport. with several undecipherable symbols. perhaps this is one of the statues mentioned in the writings of Bryma, I should look for more."
            },
            {
                "progress":70,
                "logText":"I inspected a statue north of Brightport. Carved onto the statue were the symbols for the letters l and h."
            },
            {
                "progress":75,
                "logText":"I discovered a statue southeast of Brightport. Carved onto the statue were the symbols for the letters t and e."
            },
            {
                "progress":80,
                "logText":"I discovered a statue far southwest of brightport. Carved onto the statue were the symbols for the letters a g, and r."
            },
            {
                "progress":85,
                "logText":"I spoke the activation word to the statue in the forest and can now move further."
            },
            {
                "progress":86,
                "logText":"Inside the forest was a cabin, in which I found Bryma and some strange golems made of bread."
            },
            {
                "progress":92,
                "logText":"I received the secret scroll from Bryma."
            },
            {
                "progress":95,
                "logText":"I threatened Bryma to hand me over the scroll, she gave it to me as she did not intend to keep it."
            },
            {
                "progress":96,
                "logText":"I returned the secret scroll to the Headmaster, and Stanwick was cleared of all accusations.",
                "finishesQuest":1
            },
            {
                "progress":97,
                "logText":"Although, I did not receive any reward."
            },
            {
                "progress":100,
                "logText":"I received a reward from the Headmaster for having returned the scroll."
            }
        ]
    },
    {
        "id":"brightport_nondisplay",
        "name":"brightport_nondisplay",
        "stages":[
            {
                "progress":5,
                "logText":"Talked with othinus"
            },
            {
                "progress":10,
                "logText":"Stiyl story"
            },
            {
                "progress":15,
                "logText":"met silvear"
            },
            {
                "progress":20,
                "logText":"gained access from silvear"
            },
            {
                "progress":25,
                "logText":"bought acess from silvear"
            },
            {
                "progress":30,
                "logText":"talked with silvear"
            },
            {
                "progress":31,
                "logText":"Silvear andor paid"
            },
            {
                "progress":33,
                "logText":"met  Freya"
            },
            {
                "progress":35,
                "logText":"spoke with hortensia"
            },
            {
                "progress":40,
                "logText":"History class over"
            },
            {
                "progress":42,
                "logText":"franz asked"
            },
            {
                "progress":45,
                "logText":"note given"
            },
            {
                "progress":50,
                "logText":"stanwick entrance done"
            },
            {
                "progress":55,
                "logText":"paper ink check passed"
            },
            {
                "progress":60,
                "logText":"note written"
            },
            {
                "progress":61,
                "logText":" #1"
            },
            {
                "progress":62,
                "logText":"#2"
            },
            {
                "progress":63,
                "logText":"#3"
            },
            {
                "progress":64,
                "logText":"first step done"
            },
            {
                "progress":65,
                "logText":"second step done"
            },
            {
                "progress":66,
                "logText":"Dibella incident asked"
            },
            {
                "progress":70,
                "logText":"stanwick found told"
            },
            {
                "progress":75,
                "logText":"denied key"
            },
            {
                "progress":80,
                "logText":"principal distracted"
            },
            {
                "progress":85,
                "logText":"returned scroll"
            },
            {
                "progress":86,
                "logText":"richimor story"
            },
            {
                "progress":87,
                "logText":"fiamma shop"
            },
            {
                "progress":88,
                "logText":"statue puzzle req"
            },
            {
                "progress":89,
                "logText":"L"
            },
            {
                "progress":90,
                "logText":"E"
            },
            {
                "progress":91,
                "logText":"T"
            },
            {
                "progress":92,
                "logText":"H"
            },
            {
                "progress":93,
                "logText":"G"
            },
            {
                "progress":94,
                "logText":"A"
            },
            {
                "progress":95,
                "logText":"R"
            },
            {
                "progress":96,
                "logText":"L correct"
            },
            {
                "progress":97,
                "logText":"E correct"
            },
            {
                "progress":98,
                "logText":"T correct"
            },
            {
                "progress":99,
                "logText":"H correct"
            },
            {
                "progress":100,
                "logText":"G correct"
            },
            {
                "progress":101,
                "logText":"A correct"
            },
            {
                "progress":102,
                "logText":"R correct"
            },
            {
                "progress":103,
                "logText":"got library key"
            }
        ]
    },
    {
        "id":"brightport_lizard",
        "name":"The weight of scales",
        "stages":[
            {
                
            }
        ]
    },
    {
        "id":"brightport_fiamma",
        "name":"Too hot to handle",
        "stages":[
            {
                "progress":5,
                "logText":"Fiamma, the swordsmith of Brightport, is willing to forge me a sword if I can bring him the materials."
            },
            {
                "progress":10,
                "logText":"In the mountains near the road to Remgard lies a dangerous area overrun by Arulirs, beasts with skin as tough as steel."
            },
            {
                "progress":15,
                "logText":"Fiamma has asked for a strip of Arulir skin, coveted for its durability and flexibility. He also requires 15 lava rocks from the mountain cave, which burn hotter than any ordinary coal."
            },
            {
                "progress":20,
                "logText":"The final material is a red crystal from a Gornaud, a ferocious beast that sometimes forms these rare crystals on its body."
            },
            {
                "progress":25,
                "logText":"I brought Fiamma the arulir skin and lava rocks."
            },
            {
                "progress":30,
                "logText":"I brought Fiamma the red crystal."
            },
            {
                "progress":35,
                "logText":"I gave all the materials to Fiamma. He thanked me and told me to come back later when it’s finished."
            },
            {
                "progress":40,
                "logText":"To my surprise, the sword he forged heats up on contact with air and requires special gloves to handle. Made of the Arulir skin I brought."
            },
            {
                "progress":45,
                "logText":"I don't usually use two-handed swords, so I asked Fiamma to give me something else, and he gave me a sharp glaive.",
                "finishesQuest":1
            },
            {
                "progress":50,
                "logText":"I thanked Fiamma and went on my merry way.",
                "finishesQuest":1
            }
        ]
    }
]